; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-9)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 )
(:init
(on b1 b6)
(on b2 b5)
(ontable b3)
(on b4 b9)
(on b5 b3)
(on b6 b8)
(ontable b7)
(on b8 b7)
(ontable b9)
(clear b1)
(clear b2)
(clear b4)
)
(:goal
(and
(on b2 b1)
(on b3 b6)
(on b4 b3)
(on b5 b7)
(on b6 b8)
(on b7 b2)
(on b8 b9)
(on b9 b5))
)
)

; plan
1. (move-b-to-t b4 b9)
   deleted: (on b4 b9)
   added: (ontable b4) (clear b9)
   goals met: 1 of 8
2. (move-b-to-t b1 b6)
   deleted: (on b1 b6)
   added: (ontable b1) (clear b6)
   goals met: 1 of 8
3. (move-b-to-b b6 b8 b4)
   deleted: (clear b4) (on b6 b8)
   added: (on b6 b4) (clear b8)
   goals met: 0 of 8
4. (move-b-to-b b2 b5 b1)
   deleted: (clear b1) (on b2 b5)
   added: (on b2 b1) (clear b5)
   goals met: 1 of 8
5. (move-b-to-b b8 b7 b6)
   deleted: (clear b6) (on b8 b7)
   added: (on b8 b6) (clear b7)
   goals met: 1 of 8
6. (move-t-to-b b7 b2)
   deleted: (clear b2) (ontable b7)
   added: (on b7 b2)
   goals met: 2 of 8
7. (move-b-to-b b5 b3 b7)
   deleted: (clear b7) (on b5 b3)
   added: (on b5 b7) (clear b3)
   goals met: 3 of 8
8. (move-t-to-b b9 b5)
   deleted: (clear b5) (ontable b9)
   added: (on b9 b5)
   goals met: 4 of 8
9. (move-b-to-b b8 b6 b9)
   deleted: (clear b9) (on b8 b6)
   added: (on b8 b9) (clear b6)
   goals met: 5 of 8
10. (move-b-to-b b6 b4 b8)
   deleted: (clear b8) (on b6 b4)
   added: (on b6 b8) (clear b4)
   goals met: 6 of 8
11. (move-t-to-b b3 b6)
   deleted: (clear b6) (ontable b3)
   added: (on b3 b6)
   goals met: 7 of 8
12. (move-t-to-b b4 b3)
   deleted: (clear b3) (ontable b4)
   added: (on b4 b3)
   goals met: 8 of 8
